InformationRegisters/RMQ_НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>RMQ_НастройкиПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресХоста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПакетаВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/RMQ_ОчередьИсходящих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>RMQ_ОчередьИсходящих</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеJSON</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийОчередьИсходящих</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>ДЛЯ UUID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/RMQ_ОчередиКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>RMQ_ОчередиКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/RMQ_ОчередьВходящих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>RMQ_ОчередьВходящих</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеJSON</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийОчередьИсходящих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийОчередьИсходящих</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИнтеграцияRabbitMQСервер/Ext/Module.bsl
// Возвращает настройки подключения к RabbitMQ по указанному имени.
//
// Параметры:
//   ИмяПодключения - Строка - имя подключения в регистре настроек
//
// Возвращаемое значение:
//   Структура:
//     * АдресХоста - Строка - адрес сервера RabbitMQ
//     * Порт - Число - порт подключения
//     * Пользователь - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
//     * ВиртуальныйХост - Строка - виртуальный хост
//     * РазмерПакетаВыгрузки - Число - размер пакета для выгрузки
//     * ИмяМакета - Строка - имя общего макета компоненты
//     * ИмяПоставщика - Строка - имя поставщика компоненты
//     * Компонента - Строка - идентификатор внешней компоненты
Функция ПолучитьНастройкиПодключения(Знач ИмяПодключения) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	RMQ_НастройкиПодключения.ИмяПодключения КАК ИмяПодключения,
	|	RMQ_НастройкиПодключения.АдресХоста КАК АдресХоста,
	|	RMQ_НастройкиПодключения.Порт КАК Порт,
	|	RMQ_НастройкиПодключения.Пользователь КАК Пользователь,
	|	RMQ_НастройкиПодключения.Пароль КАК Пароль,
	|	RMQ_НастройкиПодключения.ВиртуальныйХост КАК ВиртуальныйХост,
	|	RMQ_НастройкиПодключения.РазмерПакетаВыгрузки КАК РазмерПакетаВыгрузки
	|ИЗ
	|	РегистрСведений.RMQ_НастройкиПодключения КАК RMQ_НастройкиПодключения
	|ГДЕ
	|	RMQ_НастройкиПодключения.ИмяПодключения = &ИмяПодключения";
	Запрос.УстановитьПараметр("ИмяПодключения", ИмяПодключения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		ТекстОшибки = НСтр("ru = 'В регистре настроек RMQ не найдена запись ""%1"".'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИмяПодключения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Настройки = Новый Структура;
	Настройки.Вставить("АдресХоста",      Выборка.АдресХоста);
	Настройки.Вставить("Порт",            Выборка.Порт);
	Настройки.Вставить("Пользователь",    Выборка.Пользователь);
	Настройки.Вставить("Пароль",          Выборка.Пароль);
	Настройки.Вставить("ВиртуальныйХост", Выборка.ВиртуальныйХост);
	Настройки.Вставить("РазмерПакетаВыгрузки", Выборка.РазмерПакетаВыгрузки);
	Настройки.Вставить("ИмяМакета", "ОбщийМакет.PinkRabbitMQ");
	Настройки.Вставить("ИмяПоставщика", "BITERP");
	Настройки.Вставить("Компонента", "AddIn.BITERP.PinkRabbitMQ");
	
	Возврат Настройки;
	
КонецФункции

// Возвращает клиент для работы с шиной сообщений RabbitMQ и устанавливает соединение.
//
// Параметры:
//   Настройки - Структура - настройки подключения:
//               * ИмяМакета - Строка - имя макета внешней компоненты
//               * ИмяПоставщика - Строка - имя поставщика внешней компоненты
//               * Компонента - Строка - имя компоненты для создания объекта
//               * АдресХоста - Строка - адрес сервера RabbitMQ
//               * Порт - Число - порт сервера RabbitMQ
//               * Пользователь - Строка - имя пользователя для аутентификации
//               * Пароль - Строка - пароль пользователя
//               * ВиртуальныйХост - Строка - виртуальный хост
//
// Возвращаемое значение:
//   Объект - клиент для работы с RabbitMQ
//   - Неопределено - если соединение не установлено
Функция УстановитьСоединение(Настройки) Экспорт
	
	Если НЕ ПодключитьВнешнююКомпоненту(Настройки.ИмяМакета, Настройки.ИмяПоставщика, ТипВнешнейКомпоненты.Native) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось загрузить Native-компоненту PinkRabbitMQ из макета!'");
	КонецЕсли;
	
	Клиент = Новый(Настройки.Компонента);
	
	Попытка   	
		Клиент.Connect(Настройки.АдресХоста, Настройки.Порт, Настройки.Пользователь, Настройки.Пароль, Настройки.ВиртуальныйХост);
	Исключение
		ТекстОшибки = ОписаниеОшибки() + " | Лог RMQ: " + Клиент.GetLastError();
		Клиент = Неопределено;
		ЛогированиеПриложений.КритическаяОшибка("Клиент.Connect.Ошибка", Новый Структура("Объект, Сообщение, ДопДанные", "Клиент.Connect", "Ошибка в ИнтеграцияRabbitMQСервер.УстановитьСоединение", ТекстОшибки));
		ВызватьИсключение НСтр("ru = 'Сетевой сбой при подключении к шине RabbitMQ. Подробности в ЖурналЛогирования.'");
	КонецПопытки;
	
	Возврат Клиент;
КонецФункции

// Отправляет сообщение в очередь RabbitMQ через указанное подключение. Выполняет автоматическую сериализацию данных.
//
// Параметры:
//   ИмяПодключения - Строка - имя настроек подключения
//   ИмяОчереди - Строка - имя очереди
//   Данные - Строка - текст сообщения
//         - Структура, Массив, Соответствие - объект для сериализации в JSON
//         - Произвольный - данные, преобразуемые в строку
//   DurableОчередь - Булево - признак сохранения очереди при перезапуске сервера. Значение по умолчанию: Истина
Процедура ОтправитьСообщение(Знач ИмяПодключения, Знач ИмяОчереди, Знач Данные, Знач DurableОчередь = Истина) Экспорт
	Настройки = ПолучитьНастройкиПодключения(ИмяПодключения);
	Клиент = УстановитьСоединение(Настройки);
	
	ТекстДляОтправки = "";
	
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных = Тип("Строка") Тогда
		ТекстДляОтправки = Данные;
	ИначеЕсли ТипДанных = Тип("Структура") Или ТипДанных = Type("Массив") Или ТипДанных = Тип("Соответствие") Тогда
		Попытка
			ЗаписьJSON = Новый ЗаписьJSON;
			ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет," ", Истина);
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
			ЗаписатьJSON(ЗаписьJSON, Данные);
			ТекстДляОтправки = ЗаписьJSON.Закрыть();
		Исключение
			ВызватьИсключение НСтр("ru = 'Ошибка нативной сериализации объекта 1С в JSON!'") 
				+ " " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	Иначе
		ТекстДляОтправки = Строка(Данные);
	КонецЕсли;
	
	Попытка
		onlyCheckIfExists = Ложь;       
		exclusive         = Ложь;       
		autodelete        = Ложь;  
		Клиент.DeclareQueue(ИмяОчереди, onlyCheckIfExists, DurableОчередь, exclusive, autodelete);
		
		Клиент.BasicPublish("", ИмяОчереди, ТекстДляОтправки, , Ложь);
		Клиент = Неопределено;
		ЛогированиеПриложений.Инфо("ОтправитьСообщение.Успех", Новый Структура("Объект, Сообщение, ДопДанные", "Клиент.BasicPublish", СтрШаблон("Успешно отправлен пакет в очередь %1. Тип источника: %2. Размер: %3 симв.", 
				ИмяОчереди, ТипДанных, СтрДлина(ТекстДляОтправки))));
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Если Клиент <> Неопределено Тогда
			ТекстОшибки = ТекстОшибки + " | " + Клиент.GetLastError();
			Клиент = Неопределено;
		КонецЕсли;
		ЛогированиеПриложений.КритическаяОшибка("ОтправитьСообщение.Ошибка", Новый Структура("Объект, Сообщение, ДопДанные", "Клиент.BasicPublish", "Ошибка в отправке сообщения", ТекстОшибки));
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось доставить сообщение в очередь %1.'"), ИмяОчереди);	
	КонецПопытки;
КонецПроцедуры

Процедура ЗарегистрироватьКВыгрузке(Знач ИмяПодключения, Знач ИмяОчереди, Знач Данные) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, Данные);
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	СжатыеДанные = Новый ХранилищеЗначения(ТекстJSON, Новый СжатиеДанных(9));
	
	МенеджерЗаписи = РегистрыСведений.RMQ_ОчередьИсходящих.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Строка(Новый УникальныйИдентификатор);
	МенеджерЗаписи.ИмяПодключения = ИмяПодключения;
	МенеджерЗаписи.ИмяОчереди = ИмяОчереди;
	МенеджерЗаписи.ДанныеJSON = СжатыеДанные;
	МенеджерЗаписи.ДатаСоздания = ТекущаяДата();
	МенеджерЗаписи.Состояние = Перечисления.ВидыСостоянийОчередьИсходящих.Новый;
	МенеджерЗаписи.КоличествоПопыток = 0;
	МенеджерЗаписи.Записать();
КонецПроцедуры

// Загружает сообщения из активных очередей RabbitMQ в регистр RMQ_ОчередьВходящих.
Процедура ВыполнитьЗагрузкуПакетовИзRabbitMQ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Очереди.ИмяПодключения КАК ИмяПодключения,
		|	Очереди.ИмяОчереди КАК ИмяОчереди
		|ИЗ
		|	РегистрСведений.RMQ_ОчередиКЗагрузке КАК Очереди
		|ГДЕ
		|	Очереди.Активно = ИСТИНА";
	ТаблицаОчередей = Запрос.Выполнить().Выгрузить();
	
	ОтветныйТекст = "";
	ТегСообщения = 0;
	
	ТекущееПодключение = "";
	Клиент = Неопределено;
	Для Каждого СтрокаОчереди Из ТаблицаОчередей Цикл
		
		Если СтрокаОчереди.ИмяПодключения <> ТекущееПодключение Тогда
			Если Клиент <> Неопределено Тогда Клиент = Неопределено; КонецЕсли;
			ТекущееПодключение = СтрокаОчереди.ИмяПодключения;
			Настройки = ПолучитьНастройкиПодключения(ТекущееПодключение);
			Клиент = УстановитьСоединение(Настройки);
		КонецЕсли;
	
		ЛимитПакета = ?(Настройки.РазмерПакетаВыгрузки = 0, 20, Настройки.РазмерПакетаВыгрузки);

		Потребитель = Клиент.BasicConsume(СтрокаОчереди.ИмяОчереди, "", Ложь, Ложь, 0);
		НаборВходящих = РегистрыСведений.RMQ_ОчередьВходящих.СоздатьНаборЗаписей();
		СчетчикОтработанных = 0;
		МассивТегов = Новый Массив;
		Пока Истина Цикл
			Если СчетчикОтработанных >= ЛимитПакета Тогда Прервать; КонецЕсли;
				ОтветныйТекст = ""; ТегСообщения = 0; УспешноеЧтение = Ложь;
				
			Попытка
				УспешноеЧтение = Клиент.BasicConsumeMessage("", ОтветныйТекст, ТегСообщения, 3000);
			Исключение
				ТекстОшибкиВК = Клиент.GetLastError();
				Прервать; 
			КонецПопытки;

			Если Не УспешноеЧтение Тогда Прервать; КонецЕсли;
			МассивТегов.Добавить(ТегСообщения);
			СжатыйВходнойJSON = Новый ХранилищеЗначения(ОтветныйТекст, Новый СжатиеДанных(9));
			НоваяСтрока = НаборВходящих.Добавить();
			НоваяСтрока.Идентификатор  = Строка(Новый УникальныйИдентификатор);
			НоваяСтрока.ДанныеJSON     = СжатыйВходнойJSON;
			НоваяСтрока.ДатаПолучения  = ТекущаяДата();
			НоваяСтрока.Состояние     = Ложь;
			СчетчикОтработанных = СчетчикОтработанных + 1;
			ОтветныйТекст = "";
			ТегСообщения  = 0;
		КонецЦикла;
		
		Для Каждого ТекущийТег Из МассивТегов Цикл
			Попытка
				Клиент.BasicAck(ТекущийТег);
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ОтветныйТекст = "";
		ТегСообщения  = 0;
		Клиент.BasicCancel(Потребитель);
		Если НаборВходящих.Количество() > 0 Тогда
			Попытка
				НаборВходящих.Записать(Ложь);
			Исключение
				ЛогированиеПриложений.КритическаяОшибка("ВыполнитьЗагрузкуПакетовИзRabbitMQ.Ошибка", Новый Структура("Объект, Сообщение, ДопДанные", "НаборВходящих.Записать", "Ошибка в записи очередь входящий", ОписаниеОшибки()));
				ВызватьИсключение "Критический сбой СУБД при фиксации пакета ответов.";
			КонецПопытки;
		КонецЕсли;
	
	КонецЦикла;
	
	Клиент = Неопределено;
	
КонецПроцедуры

// Выполняет выгрузку сообщений из очереди исходящих сообщений в RabbitMQ пакетами согласно настройкам подключения. Обрабатывает ошибки отправки с ограничением количества попыток
Процедура ВыполнитьВыгрузкуПакетовВRabbitMQ() Экспорт
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Очередь.Идентификатор КАК Идентификатор,
		|	Очередь.ИмяПодключения КАК ИмяПодключения,
		|	Очередь.ДатаСоздания КАК ДатаСоздания
		|ПОМЕСТИТЬ ВТ_ТолькоКлючи
		|ИЗ
		|	РегистрСведений.RMQ_ОчередьИсходящих КАК Очередь
		|ГДЕ
		|	Очередь.Состояние = &Состояние
		|	И Очередь.КоличествоПопыток < 5
		|ИНДЕКСИРОВАТЬ ПО
		|	ИмяПодключения,
		|	ДатаСоздания,
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т1.Идентификатор КАК Идентификатор,
		|	Т1.ИмяПодключения КАК ИмяПодключения,
		|	КОЛИЧЕСТВО(Т2.Идентификатор) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_КлючиСНумерацией
		|ИЗ
		|	ВТ_ТолькоКлючи КАК Т1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТолькоКлючи КАК Т2
		|		ПО Т1.ИмяПодключения = Т2.ИмяПодключения
		|		И (Т1.ДатаСоздания > Т2.ДатаСоздания ИЛИ (Т1.ДатаСоздания = Т2.ДатаСоздания И Т1.Идентификатор >= Т2.Идентификатор))
		|СГРУППИРОВАТЬ ПО
		|	Т1.Идентификатор,
		|	Т1.ИмяПодключения
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОчередьОсновная.Идентификатор КАК Идентификатор,
		|	Ключи.ИмяПодключения КАК ИмяПодключения,
		|	ОчередьОсновная.ИмяОчереди КАК ИмяОчереди,
		|	ОчередьОсновная.ДанныеJSON КАК ДанныеJSON
		|ИЗ
		|	ВТ_КлючиСНумерацией КАК Ключи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.RMQ_НастройкиПодключения КАК Настройки
		|		ПО Ключи.ИмяПодключения = Настройки.ИмяПодключения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.RMQ_ОчередьИсходящих КАК ОчередьОсновная
		|		ПО Ключи.Идентификатор = ОчередьОсновная.Идентификатор
		|ГДЕ
		|	Ключи.НомерСтроки <= ВЫБОР
		|			КОГДА Настройки.РазмерПакетаВыгрузки = 0 ТОГДА 20
		|			ИНАЧЕ Настройки.РазмерПакетаВыгрузки
		|		КОНЕЦ
		|УПОРЯДОЧИТЬ ПО
		|	Ключи.ИмяПодключения";
		
	Запрос.УстановитьПараметр("Состояние", Перечисления.ВидыСостоянийОчередьИсходящих.Новый);
	ТаблицаВсехПакетов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаВсехПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееПодключение = "";
	КлиентRMQ          = Неопределено;
	
	Для Каждого СтрокаПакета Из ТаблицаВсехПакетов Цикл
		
		Если СтрокаПакета.ИмяПодключения <> ТекущееПодключение Тогда
			Если КлиентRMQ <> Неопределено Тогда
				КлиентRMQ = Неопределено;
			КонецЕсли;
			ТекущееПодключение = СтрокаПакета.ИмяПодключения;
			НастройкиПодключения = ПолучитьНастройкиПодключения(ТекущееПодключение);
			КлиентRMQ = УстановитьСоединение(НастройкиПодключения);
		КонецЕсли;
		
		ЧистыйТекстJSON = СтрокаПакета.ДанныеJSON.Получить();
		Если ЧистыйТекстJSON = Неопределено Тогда
			ЧистыйТекстJSON = "";
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.RMQ_ОчередьИсходящих.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = СтрокаПакета.Идентификатор;
		МенеджерЗаписи.Прочитать();
		
		Попытка
			КлиентRMQ.DeclareQueue(СтрокаПакета.ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
			КлиентRMQ.BasicPublish("", СтрокаПакета.ИмяОчереди, ЧистыйТекстJSON, 0, Ложь);
			МенеджерЗаписи.Удалить();
		Исключение
			МенеджерЗаписи.Состояние         = Перечисления.ВидыСостоянийОчередьИсходящих.Ошибка;
			МенеджерЗаписи.КоличествоПопыток = МенеджерЗаписи.КоличествоПопыток + 1;
			МенеджерЗаписи.ТекстОшибки       = Лев(ОписаниеОшибки(), 300);
			МенеджерЗаписи.Записать();
		КонецПопытки;
		
	КонецЦикла;
	
	Если КлиентRMQ <> Неопределено Тогда
		КлиентRMQ = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает входящие пакеты сообщений из очереди RabbitMQ: читает, парсит JSON и передает в бизнес-логику.
Процедура ВыполнитьОбработкуВходящихПакетов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Входящие.Идентификатор КАК Идентификатор,
		|	Входящие.ДанныеJSON КАК ДанныеJSON
		|ИЗ
		|	РегистрСведений.RMQ_ОчередьВходящих КАК Входящие
		|ГДЕ
		|	Входящие.Состояние = ЛОЖЬ
		|УПОРЯДОЧИТЬ ПО
		|	Входящие.ДатаПолучения ВОЗР";
		
	ТаблицаПакетов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаПакет Из ТаблицаПакетов Цикл
		
		МенеджерЗаписи = РегистрыСведений.RMQ_ОчередьВходящих.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор = СтрокаПакет.Идентификатор;
		МенеджерЗаписи.Прочитать();
		
		// Извлекаем и разжимаем нативный JSON из ХранилищаЗначений
		ТекстJSON = СтрокаПакет.ДанныеJSON.Получить();
		
		Если ПустаяСтрока(ТекстJSON) Тогда
			МенеджерЗаписи.Состояние  = Истина;
			МенеджерЗаписи.ТекстОшибки = "Пустой пакет данных.";
			МенеджерЗаписи.Записать();
			Продолжить;
		КонецЕсли;
		
		// Парсим JSON обратно в структуру 1С нативными средствами платформы
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстJSON);
			БизнесДанные = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Исключение
			МенеджерЗаписи.Состояние  = Истина; // Исключаем зацикливание битого пакета
			МенеджерЗаписи.ТекстОшибки = Лев("Ошибка парсинга JSON: " + ОписаниеОшибки(), 300);
			МенеджерЗаписи.Записать();
			Продолжить;
		КонецПопытки;
		
		// Передаем структуру в блок бизнес-логики внутри безопасной транзакции
		НачатьТранзакцию();
		Попытка
			
			ОбработаноУспешно = ОбработатьБизнесОбъект(БизнесДанные);
			
			Если ОбработаноУспешно Тогда
				МенеджерЗаписи.Состояние = Истина;
				МенеджерЗаписи.ТекстОшибки = "";
			Иначе
				МенеджерЗаписи.ТекстОшибки = "Пакет пропущен: отсутствует маркер формата.";
				МенеджерЗаписи.Состояние  = Истина;
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			ЗафиксироватьТранзакцию();
			
			ЛогСообщения = СтрШаблон("Парсер успешно разобрал пакет от Кролика! Менеджер: %1, Статус: %2, Сумма: %3", 
			БизнесДанные.Менеджер, БизнесДанные.СтатусЗаказа, БизнесДанные.Сумма);
			ЛогированиеПриложений.Инфо("ИнтеграцияRabbitMQ.ПарсерВходящих", Новый Структура("Объект, Сообщение, ДопДанные", "ВыполнитьОбработкуВходящихПакетов", "Разбор пакета", ЛогСообщения), Истина); 
			
		Исключение
			ОтменитьТранзакцию();
			
			// Оставляем Обработано = Ложь, чтобы повторить попытку на следующем круге регламента
			МенеджерЗаписи.ТекстОшибки = Лев("Ошибка бизнес-логики: " + ОписаниеОшибки(), 300);
			МенеджерЗаписи.Записать();
			
			ЛогированиеПриложений.Ошибка("ИнтеграцияRabbitMQ.ПарсерВходящих", Новый Структура("Объект, Сообщение, ДопДанные", "ВыполнитьОбработкуВходящихПакетов", "Ошибка в разбор пакета", ОписаниеОшибки())); 
	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет соответствие бизнес-объекта требованиям обработки.
//
// Параметры:
//   Данные - Структура - структура должна содержать свойство СтатусЗаказа
//
// Возвращаемое значение:
//   Булево - Истина, если бизнес-объект соответствует требованиям для обработки
Функция ОбработатьБизнесОбъект(Знач Данные)
	
	// Проверяем, что пришедшая структура содержит наши маркеры
	Если ТипЗнч(Данные) <> Тип("Структура") Или Не Данные.Свойство("СтатусЗаказа") Тогда
		Возврат Ложь; 
	КонецЕсли;
	
	// Здесь пишется реальное создание документов
		
	Возврат Истина;
	
КонецФункции

// Синхронизирует очереди RabbitMQ с регистром сведений RMQ_ОчередиКЗагрузке.
// Отключает очереди, которых больше нет в брокере, и добавляет или обновляет существующие.
Процедура СинхронизироватьОчередиСRabbitMQ() Экспорт
	
	ЗапросПодключений = Новый Запрос;
	ЗапросПодключений.Текст = 
		"ВЫБРАТЬ
		|	Настройки.ИмяПодключения КАК ИмяПодключения,
		|	Настройки.АдресХоста КАК АдресХоста,
		|	Настройки.Пользователь КАК Пользователь,
		|	Настройки.Пароль КАК Пароль,
		|	Настройки.ВиртуальныйХост КАК ВиртуальныйХост
		|ИЗ
		|	РегистрСведений.RMQ_НастройкиПодключения КАК Настройки";
		
	ТаблицаПодключений = ЗапросПодключений.Выполнить().Выгрузить();	
	
	ЖивыеОчередиБрокера = Новый ТаблицаЗначений;
	ЖивыеОчередиБрокера.Колонки.Добавить("ИмяПодключения", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ЖивыеОчередиБрокера.Колонки.Добавить("ИмяОчереди",     Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	
	ПортАдминки = Константы.ПортАдминкиRMQ.Получить();
	
	Для Каждого ТекущийКонтур Из ТаблицаПодключений Цикл
		
		КодированныйVhost = ?(ТекущийКонтур.ВиртуальныйХост = "/", "%2F", ТекущийКонтур.ВиртуальныйХост);
		ПутьЗапроса = СтрШаблон("/api/queues/%1", КодированныйVhost);	
		
		ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(ТекущийКонтур.Пользователь + ":" + ТекущийКонтур.Пароль, КодировкаТекста.UTF8, Ложь);
		ЗначениеАвторизации  = Base64Строка(ДвоичныеДанныеСтроки);
		ЗначениеАвторизации  = СтрЗаменить(ЗначениеАвторизации, Символы.ПС, "");
		ЗначениеАвторизации  = СтрЗаменить(ЗначениеАвторизации, Символы.ВК, "");
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Authorization", "Basic " + ЗначениеАвторизации);
		
		HTTPСоединение = Новый HTTPСоединение(ТекущийКонтур.АдресХоста, ПортАдминки, ТекущийКонтур.Пользователь, ТекущийКонтур.Пароль);
		HTTPЗапрос = Новый HTTPЗапрос(ПутьЗапроса, Заголовки);
		
		Попытка
			HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
			Если HTTPОтвет.КодСостояния <> 200 Тогда
				Продолжить; // Сервер ответил ошибкой авторизации или vhost не найден
			КонецЕсли;
			
			ТекстОтветаJSON = HTTPОтвет.ПолучитьТелоКакСтроку();
			
			// Парсим массив очередей из HTTP API
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстОтветаJSON);
			МассивОчередейКролика = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			// Наполняем таблицу живых очередей
			Для Каждого ДанныеОчереди Из МассивОчередейКролика Цикл
				НоваяСтрока = ЖивыеОчередиБрокера.Добавить();
				НоваяСтрока.ИмяПодключения = ТекущийКонтур.ИмяПодключения;
				НоваяСтрока.ИмяОчереди     = ДанныеОчереди.name; // Поле "name" возвращается HTTP API Кролика
			КонецЦикла;
			
		Исключение
			ЛогированиеПриложений.Ошибка("СинхронизироватьОчередиСRabbitMQ.Ошибка", Новый Структура("Объект, Сообщение, ДопДанные", "HTTPСоединение", "Ошибка", ОписаниеОшибки()));
		КонецПопытки;
		
	КонецЦикла;
	
	ЗапросРегистра = Новый Запрос("ВЫБРАТЬ ИмяПодключения, ИмяОчереди ИЗ РегистрСведений.RMQ_ОчередиКЗагрузке");
	ТаблицаРегистра = ЗапросРегистра.Выполнить().Выгрузить();
	
	Набор = РегистрыСведений.RMQ_ОчередиКЗагрузке.СоздатьНаборЗаписей();
	
	// А. Сначала отключаем (Активно = Ложь) очереди, которых больше нет в RabbitMQ
	Для Каждого СтрокаЛокальная Из ТаблицаРегистра Цикл
		ПараметрыПоиска = Новый Структура("ИмяПодключения, ИмяОчереди", СтрокаЛокальная.ИмяПодключения, СтрокаЛокальная.ИмяОчереди);
		НайденныеСтроки = ЖивыеОчередиБрокера.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Набор.Отбор.ИмяПодключения.Установить(СтрокаЛокальная.ИмяПодключения);
			Набор.Отбор.ИмяОчереди.Установить(СтрокаЛокальная.ИмяОчереди);
			
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.ИмяПодключения = СтрокаЛокальная.ИмяПодключения;
			НоваяЗапись.ИмяОчереди     = СтрокаЛокальная.ИмяОчереди;
			НоваяЗапись.Активно        = Ложь; 
			Набор.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКролика Из ЖивыеОчередиБрокера Цикл
		Набор.Отбор.ИмяПодключения.Установить(СтрокаКролика.ИмяПодключения);
		Набор.Отбор.ИмяОчереди.Установить(СтрокаКролика.ИмяОчереди);
		
		Набор.Очистить();
		НоваяЗапись = Набор.Добавить();
		НоваяЗапись.ИмяПодключения = СтрокаКролика.ИмяПодключения;
		НоваяЗапись.ИмяОчереди     = СтрокаКролика.ИмяОчереди;
		НоваяЗапись.Активно        = Истина;
		Набор.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры
